Merge pull request #948 from markusahlstrand/social-double-click
disable double clicks on social buttons
